LEXICON_RU: dict[str, str] = {
    '/start': '<b>Добро пожаловать в панель управления рассылкой!</b>\n'
              'Чтобы посмотреть справку, введите команду /help',
    '/access_denied': '<b>У вас нет доступа к панели управления!</b>\n'
                      'Введите команду /help',
    '/help': 'Это бот для рассылок по телеграмм каналам\n'
             'Используйте команды клавиатуры (значок около кнопки в виде скрепки)\n'
             'Если бот говорит вам, что у вас нет доступа, то обратитесь'
             ' к администратору\nЕсли вы не знаете администратора, то что'
             ' вы здесь делаете?)\n',
             
    'start_broadcast': 'Провести рассылку',
    'add_channel': 'Добавить канал',
    'show_channels': 'Каналы',
    
    'start_broadcast_answer': 'Введите сообщение для рассылки:',
    'add_channel_answer': 'Введите имя канала, который хотите подключить:',
    'show_channels_answer': 'Список подключенных каналов:',
    
    'add_channel_succes': 'Канал успешно добавлен!',
    'broadcast_succes': 'Рассылка прошла успешно!',
    
    'other_answer': 'Пожалуйста, введите корректное сообщение\n'
                    'Вы можете использовать кнопки интерфейса\n'
                    'Для этого нажмите на значок справа на строке ввода',
                    
    'cancel': 'Вы отменили действие',
}