LEXICON_RU: dict[str, str] = {
    '/start': '<b>Добро пожаловать в панель управления рассылкой!</b>\n'
              'Чтобы посмотреть справку, введите команду /help',
    '/access_denied': '<b>У вас нет доступа к панели управления!</b>\n'
                      'Введите команду /help',
    '/help': 'Это бот для рассылок по телеграмм каналам\n'
             'Используйте команды клавиатуры (значок около кнопки в виде скрепки)\n'
             'Если бот говорит вам, что у вас нет доступа, то обратитесь'
             ' к администратору @kAzaKed.',
    'cancel': 'Отмена',
    
    
    
    'broadcast_management': 'Управление рассылками',
    'channels_management': 'Управление каналами',
    'backward': 'Назад',
    
    'start_broadcast': 'Провести рассылку',
    'add_channel': 'Добавить канал',
    'show_channels': 'Список каналов',
    'delete_channel': 'Удалить канал',
    
    'broadcast_management_answer': 'Вы в панеле управления расслыками',
    'channels_management_answer': 'Вы в панеле управления каналами',
    'start_broadcast_answer': 'Введите сообщение для рассылки:',
    'add_channel_answer': 'Введите имя канала, который хотите подключить:',
    'show_channels_answer': 'Список подключенных каналов:',
    'delete_channel_answer': 'Введите имя канала, который хотите удалить.\n'
    'Обратите внимание, что бот удалит <b>ТОЛЬКО ОДИН</b> канал с введенным именем.'
    'Если вы хотите удалить больше одного дубликата, то повторите удаление столько раз'
    'сколько у вас дубликатов.',
    
    'add_channel_success': 'Канал успешно добавлен!',
    'broadcast_success': 'Рассылка прошла успешно!',
    'delete_channel_success': 'Канал успешно удален',
    
    'other_answer': 'Пожалуйста, введите корректное сообщение\n'
                    'Вы можете использовать кнопки интерфейса\n'
                    'Для этого нажмите на значок справа на строке ввода\n\n'
                    'Если считаете, что бот работает неисправно, то попробуйте'
                    'ввести вручную команду /start, если это не поможет - напишите'
                    ' администратору @kAzaKed',
                    
    'canceled': 'Вы отменили действие',
    'backwarded': 'Вы вернулись в главное меню',
    
    'start_bot_error': 'Ошибка при запуске бота, скорее всего у вас скрыт либо отсутствует алиас, '
    'необходимый для идентификации пользователя, добавьте его в профиле либо сообщите об ошибке @kAzaKed',
    'deleting_channel_error': 'Ошибка при удалении канала, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'show_channels_error': 'Ошибка при попытке получить список каналов, возможно вы пока не подключили ни одного канала'
    'попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'help_error': 'Ошибка при получении справочной инструкции, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'bacward_error': 'Ошибка при возврате в главное меню, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'adding_channel_error': 'Ошибка при создании канала, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'cancel_channel_action_error': 'Ошибка при отмене действия с каналом, '
    'попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'channel_management_error': 'Ошибка при переходе в панель управления каналами, '
    'попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'broadcast_error': 'Ошибка при отправке сообщения для рассылки, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'broadcast_cancel_error': 'Ошибка при отмене рассылки, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'start_broadcast_error': 'Ошибка при начале работы с рассылкой, попробуйте еще раз либо сообщите об ошибке @kAzaKed',
    'broadcast_management_error': 'Ошибка при переходе в панель управления рассылками'
    'попробуйте еще раз либо сообщите об ошибке @kAzaKed',
}